Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/uart.h
/* -------- UART_MR : (UART Offset: 0x04) (R/W 32) Mode Register -------- */
#define UART_MR_OPT_EN_Pos                    _UINT32_(0)                                          /* (UART_MR) UART Optical Interface Enable Position */
#define UART_MR_OPT_EN_Msk                    (_UINT32_(0x1) << UART_MR_OPT_EN_Pos)                /* (UART_MR) UART Optical Interface Enable Mask */
#define UART_MR_OPT_EN(value)                 (UART_MR_OPT_EN_Msk & (_UINT32_(value) << UART_MR_OPT_EN_Pos)) /* Assigment of value for OPT_EN in the UART_MR register */
#define   UART_MR_OPT_EN_DISABLED_Val         _UINT32_(0x0)                                        /* (UART_MR) Disables the UART optical link.  */
#define   UART_MR_OPT_EN_ENABLED_Val          _UINT32_(0x1)                                        /* (UART_MR) Enables the UART optical link.  */
#define UART_MR_OPT_EN_DISABLED               (UART_MR_OPT_EN_DISABLED_Val << UART_MR_OPT_EN_Pos)  /* (UART_MR) Disables the UART optical link. Position  */
#define UART_MR_OPT_EN_ENABLED                (UART_MR_OPT_EN_ENABLED_Val << UART_MR_OPT_EN_Pos)   /* (UART_MR) Enables the UART optical link. Position  */
#define UART_MR_OPT_RXINV_Pos                 _UINT32_(1)                                          /* (UART_MR) UART Receive Data Inverted Position */
#define UART_MR_OPT_RXINV_Msk                 (_UINT32_(0x1) << UART_MR_OPT_RXINV_Pos)             /* (UART_MR) UART Receive Data Inverted Mask */
#define UART_MR_OPT_RXINV(value)              (UART_MR_OPT_RXINV_Msk & (_UINT32_(value) << UART_MR_OPT_RXINV_Pos)) /* Assigment of value for OPT_RXINV in the UART_MR register */
#define   UART_MR_OPT_RXINV_DISABLED_Val      _UINT32_(0x0)                                        /* (UART_MR) The comparator data output is not inverted before entering UART.  */
#define   UART_MR_OPT_RXINV_ENABLED_Val       _UINT32_(0x1)                                        /* (UART_MR) The comparator data output is inverted before entering UART.  */
#define UART_MR_OPT_RXINV_DISABLED            (UART_MR_OPT_RXINV_DISABLED_Val << UART_MR_OPT_RXINV_Pos) /* (UART_MR) The comparator data output is not inverted before entering UART. Position  */
#define UART_MR_OPT_RXINV_ENABLED             (UART_MR_OPT_RXINV_ENABLED_Val << UART_MR_OPT_RXINV_Pos) /* (UART_MR) The comparator data output is inverted before entering UART. Position  */
#define UART_MR_OPT_MDINV_Pos                 _UINT32_(2)                                          /* (UART_MR) UART Modulated Data Inverted Position */
#define UART_MR_OPT_MDINV_Msk                 (_UINT32_(0x1) << UART_MR_OPT_MDINV_Pos)             /* (UART_MR) UART Modulated Data Inverted Mask */
#define UART_MR_OPT_MDINV(value)              (UART_MR_OPT_MDINV_Msk & (_UINT32_(value) << UART_MR_OPT_MDINV_Pos)) /* Assigment of value for OPT_MDINV in the UART_MR register */
#define   UART_MR_OPT_MDINV_DISABLED_Val      _UINT32_(0x0)                                        /* (UART_MR) The output of the modulator is not inverted.  */
#define   UART_MR_OPT_MDINV_ENABLED_Val       _UINT32_(0x1)                                        /* (UART_MR) The output of the modulator is inverted.  */
#define UART_MR_OPT_MDINV_DISABLED            (UART_MR_OPT_MDINV_DISABLED_Val << UART_MR_OPT_MDINV_Pos) /* (UART_MR) The output of the modulator is not inverted. Position  */
#define UART_MR_OPT_MDINV_ENABLED             (UART_MR_OPT_MDINV_ENABLED_Val << UART_MR_OPT_MDINV_Pos) /* (UART_MR) The output of the modulator is inverted. Position  */
#define UART_MR_OPT_DMOD_Pos                  _UINT32_(3)                                          /* (UART_MR) Optical Demodulation Enable Position */
#define UART_MR_OPT_DMOD_Msk                  (_UINT32_(0x1) << UART_MR_OPT_DMOD_Pos)              /* (UART_MR) Optical Demodulation Enable Mask */
#define UART_MR_OPT_DMOD(value)               (UART_MR_OPT_DMOD_Msk & (_UINT32_(value) << UART_MR_OPT_DMOD_Pos)) /* Assigment of value for OPT_DMOD in the UART_MR register */
#define   UART_MR_OPT_DMOD_DISABLED_Val       _UINT32_(0x0)                                        /* (UART_MR) The optical demodulator is disabled. External demodulation must be enabled.  */
#define   UART_MR_OPT_DMOD_ENABLED_Val        _UINT32_(0x1)                                        /* (UART_MR) The optical demodulator is enabled.  */
#define UART_MR_OPT_DMOD_DISABLED             (UART_MR_OPT_DMOD_DISABLED_Val << UART_MR_OPT_DMOD_Pos) /* (UART_MR) The optical demodulator is disabled. External demodulation must be enabled. Position  */
#define UART_MR_OPT_DMOD_ENABLED              (UART_MR_OPT_DMOD_ENABLED_Val << UART_MR_OPT_DMOD_Pos) /* (UART_MR) The optical demodulator is enabled. Position  */
#define UART_MR_FILTER_Pos                    _UINT32_(4)                                          /* (UART_MR) Receiver Digital Filter Position */
#define UART_MR_FILTER_Msk                    (_UINT32_(0x1) << UART_MR_FILTER_Pos)                /* (UART_MR) Receiver Digital Filter Mask */
#define UART_MR_FILTER(value)                 (UART_MR_FILTER_Msk & (_UINT32_(value) << UART_MR_FILTER_Pos)) /* Assigment of value for FILTER in the UART_MR register */
#define   UART_MR_FILTER_DISABLED_Val         _UINT32_(0x0)                                        /* (UART_MR) UART does not filter the receive line.  */
#define   UART_MR_FILTER_ENABLED_Val          _UINT32_(0x1)                                        /* (UART_MR) UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority).  */
#define UART_MR_FILTER_DISABLED               (UART_MR_FILTER_DISABLED_Val << UART_MR_FILTER_Pos)  /* (UART_MR) UART does not filter the receive line. Position  */
#define UART_MR_FILTER_ENABLED                (UART_MR_FILTER_ENABLED_Val << UART_MR_FILTER_Pos)   /* (UART_MR) UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority). Position  */
#define UART_MR_ACON_Pos                      _UINT32_(5)                                          /* (UART_MR) Analog Comparator Enable Position */
#define UART_MR_ACON_Msk                      (_UINT32_(0x1) << UART_MR_ACON_Pos)                  /* (UART_MR) Analog Comparator Enable Mask */
#define UART_MR_ACON(value)                   (UART_MR_ACON_Msk & (_UINT32_(value) << UART_MR_ACON_Pos)) /* Assigment of value for ACON in the UART_MR register */
#define   UART_MR_ACON_DISABLED_Val           _UINT32_(0x0)                                        /* (UART_MR) The analog comparator is disabled. If OPT_EN=1, the analog comparator is enabled.  */
#define   UART_MR_ACON_ENABLED_Val            _UINT32_(0x1)                                        /* (UART_MR) The analog comparator is enabled.  */
#define UART_MR_ACON_DISABLED                 (UART_MR_ACON_DISABLED_Val << UART_MR_ACON_Pos)      /* (UART_MR) The analog comparator is disabled. If OPT_EN=1, the analog comparator is enabled. Position  */
#define UART_MR_ACON_ENABLED                  (UART_MR_ACON_ENABLED_Val << UART_MR_ACON_Pos)       /* (UART_MR) The analog comparator is enabled. Position  */
#define UART_MR_EDGESEL_Pos                   _UINT32_(6)                                          /* (UART_MR) Analog Comparator Output Edge Selection Position */
#define UART_MR_EDGESEL_Msk                   (_UINT32_(0x3) << UART_MR_EDGESEL_Pos)               /* (UART_MR) Analog Comparator Output Edge Selection Mask */
#define UART_MR_EDGESEL(value)                (UART_MR_EDGESEL_Msk & (_UINT32_(value) << UART_MR_EDGESEL_Pos)) /* Assigment of value for EDGESEL in the UART_MR register */
#define   UART_MR_EDGESEL_RISING_Val          _UINT32_(0x0)                                        /* (UART_MR) The UART_SR.ACE is set if a rising edge is detected on analog comparator output.  */
#define   UART_MR_EDGESEL_FALLING_Val         _UINT32_(0x1)                                        /* (UART_MR) The UART_SR.ACE is set if a falling edge is detected on analog comparator output.  */
#define   UART_MR_EDGESEL_ANY_EDGE_Val        _UINT32_(0x2)                                        /* (UART_MR) The UART_SR.ACE is set as soon as an edge is detected on analog comparator output.  */
#define UART_MR_EDGESEL_RISING                (UART_MR_EDGESEL_RISING_Val << UART_MR_EDGESEL_Pos)  /* (UART_MR) The UART_SR.ACE is set if a rising edge is detected on analog comparator output. Position  */
#define UART_MR_EDGESEL_FALLING               (UART_MR_EDGESEL_FALLING_Val << UART_MR_EDGESEL_Pos) /* (UART_MR) The UART_SR.ACE is set if a falling edge is detected on analog comparator output. Position  */
#define UART_MR_EDGESEL_ANY_EDGE              (UART_MR_EDGESEL_ANY_EDGE_Val << UART_MR_EDGESEL_Pos) /* (UART_MR) The UART_SR.ACE is set as soon as an edge is detected on analog comparator output. Position  */
#define UART_MR_OPT_WKUP_Pos                  _UINT32_(8)                                          /* (UART_MR) Optical Link Activity Wake-up Enable Position */
#define UART_MR_OPT_WKUP_Msk                  (_UINT32_(0x1) << UART_MR_OPT_WKUP_Pos)              /* (UART_MR) Optical Link Activity Wake-up Enable Mask */
#define UART_MR_OPT_WKUP(value)               (UART_MR_OPT_WKUP_Msk & (_UINT32_(value) << UART_MR_OPT_WKUP_Pos)) /* Assigment of value for OPT_WKUP in the UART_MR register */
#define   UART_MR_OPT_WKUP_DISABLED_Val       _UINT32_(0x0)                                        /* (UART_MR) To detect any activity on the output of analog comparator, the clock is always active and OPT_EN must be written to 1..  */
#define   UART_MR_OPT_WKUP_ENABLED_Val        _UINT32_(0x1)                                        /* (UART_MR) If OPT_EN=0 and a logical 1 is detected after inversion (if RXINV=1) on analog comparator output, the clock if automatically enabled for all UART sub-modules. After a period of inactivity on URXD (time-out) the software can instruct the UART to disabled the clock of all sub-modules to reduce power consumption by applying the UART_CR.OPT_SLEEP command.  */
#define UART_MR_OPT_WKUP_DISABLED             (UART_MR_OPT_WKUP_DISABLED_Val << UART_MR_OPT_WKUP_Pos) /* (UART_MR) To detect any activity on the output of analog comparator, the clock is always active and OPT_EN must be written to 1.. Position  */
#define UART_MR_OPT_WKUP_ENABLED              (UART_MR_OPT_WKUP_ENABLED_Val << UART_MR_OPT_WKUP_Pos) /* (UART_MR) If OPT_EN=0 and a logical 1 is detected after inversion (if RXINV=1) on analog comparator output, the clock if automatically enabled for all UART sub-modules. After a period of inactivity on URXD (time-out) the software can instruct the UART to disabled the clock of all sub-modules to reduce power consumption by applying the UART_CR.OPT_SLEEP command. Position  */
#define UART_MR_PAR_Pos                       _UINT32_(9)                                          /* (UART_MR) Parity Type Position */
#define UART_MR_PAR_Msk                       (_UINT32_(0x7) << UART_MR_PAR_Pos)                   /* (UART_MR) Parity Type Mask */
#define UART_MR_PAR(value)                    (UART_MR_PAR_Msk & (_UINT32_(value) << UART_MR_PAR_Pos)) /* Assigment of value for PAR in the UART_MR register */
#define   UART_MR_PAR_EVEN_Val                _UINT32_(0x0)                                        /* (UART_MR) Even Parity  */
#define   UART_MR_PAR_ODD_Val                 _UINT32_(0x1)                                        /* (UART_MR) Odd Parity  */
#define   UART_MR_PAR_SPACE_Val               _UINT32_(0x2)                                        /* (UART_MR) Space: parity forced to 0  */
#define   UART_MR_PAR_MARK_Val                _UINT32_(0x3)                                        /* (UART_MR) Mark: parity forced to 1  */
#define   UART_MR_PAR_NO_Val                  _UINT32_(0x4)                                        /* (UART_MR) No parity  */
#define UART_MR_PAR_EVEN                      (UART_MR_PAR_EVEN_Val << UART_MR_PAR_Pos)            /* (UART_MR) Even Parity Position  */
#define UART_MR_PAR_ODD                       (UART_MR_PAR_ODD_Val << UART_MR_PAR_Pos)             /* (UART_MR) Odd Parity Position  */
#define UART_MR_PAR_SPACE                     (UART_MR_PAR_SPACE_Val << UART_MR_PAR_Pos)           /* (UART_MR) Space: parity forced to 0 Position  */
#define UART_MR_PAR_MARK                      (UART_MR_PAR_MARK_Val << UART_MR_PAR_Pos)            /* (UART_MR) Mark: parity forced to 1 Position  */
#define UART_MR_PAR_NO                        (UART_MR_PAR_NO_Val << UART_MR_PAR_Pos)              /* (UART_MR) No parity Position  */
#define UART_MR_BRSRCCK_Pos                   _UINT32_(12)                                         /* (UART_MR) Baud Rate Source Clock Position */
#define UART_MR_BRSRCCK_Msk                   (_UINT32_(0x1) << UART_MR_BRSRCCK_Pos)               /* (UART_MR) Baud Rate Source Clock Mask */
#define UART_MR_BRSRCCK(value)                (UART_MR_BRSRCCK_Msk & (_UINT32_(value) << UART_MR_BRSRCCK_Pos)) /* Assigment of value for BRSRCCK in the UART_MR register */
#define   UART_MR_BRSRCCK_PERIPH_CLK_Val      _UINT32_(0x0)                                        /* (UART_MR) The baud rate is driven by the peripheral clock  */
#define   UART_MR_BRSRCCK_GCLK_Val            _UINT32_(0x1)                                        /* (UART_MR) The baud rate is driven by a PMC-programmable clock GCLK (see the section "Power Management Controller (PMC)").  */
#define UART_MR_BRSRCCK_PERIPH_CLK            (UART_MR_BRSRCCK_PERIPH_CLK_Val << UART_MR_BRSRCCK_Pos) /* (UART_MR) The baud rate is driven by the peripheral clock Position  */
#define UART_MR_BRSRCCK_GCLK                  (UART_MR_BRSRCCK_GCLK_Val << UART_MR_BRSRCCK_Pos)    /* (UART_MR) The baud rate is driven by a PMC-programmable clock GCLK (see the section "Power Management Controller (PMC)"). Position  */
#define UART_MR_CHMODE_Pos                    _UINT32_(14)                                         /* (UART_MR) Channel Mode Position */
#define UART_MR_CHMODE_Msk                    (_UINT32_(0x3) << UART_MR_CHMODE_Pos)                /* (UART_MR) Channel Mode Mask */
#define UART_MR_CHMODE(value)                 (UART_MR_CHMODE_Msk & (_UINT32_(value) << UART_MR_CHMODE_Pos)) /* Assigment of value for CHMODE in the UART_MR register */
#define   UART_MR_CHMODE_NORMAL_Val           _UINT32_(0x0)                                        /* (UART_MR) Normal mode  */
#define   UART_MR_CHMODE_AUTOMATIC_Val        _UINT32_(0x1)                                        /* (UART_MR) Automatic echo  */
#define   UART_MR_CHMODE_LOCAL_LOOPBACK_Val   _UINT32_(0x2)                                        /* (UART_MR) Local loopback  */
#define   UART_MR_CHMODE_REMOTE_LOOPBACK_Val  _UINT32_(0x3)                                        /* (UART_MR) Remote loopback  */
#define UART_MR_CHMODE_NORMAL                 (UART_MR_CHMODE_NORMAL_Val << UART_MR_CHMODE_Pos)    /* (UART_MR) Normal mode Position  */
#define UART_MR_CHMODE_AUTOMATIC              (UART_MR_CHMODE_AUTOMATIC_Val << UART_MR_CHMODE_Pos) /* (UART_MR) Automatic echo Position  */
#define UART_MR_CHMODE_LOCAL_LOOPBACK         (UART_MR_CHMODE_LOCAL_LOOPBACK_Val << UART_MR_CHMODE_Pos) /* (UART_MR) Local loopback Position  */
#define UART_MR_CHMODE_REMOTE_LOOPBACK        (UART_MR_CHMODE_REMOTE_LOOPBACK_Val << UART_MR_CHMODE_Pos) /* (UART_MR) Remote loopback Position  */
#define UART_MR_OPT_CLKDIV_Pos                _UINT32_(16)                                         /* (UART_MR) Optical Link Clock Divider Position */
#define UART_MR_OPT_CLKDIV_Msk                (_UINT32_(0x1F) << UART_MR_OPT_CLKDIV_Pos)           /* (UART_MR) Optical Link Clock Divider Mask */
#define UART_MR_OPT_CLKDIV(value)             (UART_MR_OPT_CLKDIV_Msk & (_UINT32_(value) << UART_MR_OPT_CLKDIV_Pos)) /* Assigment of value for OPT_CLKDIV in the UART_MR register */
#define UART_MR_OPT_DUTY_Pos                  _UINT32_(24)                                         /* (UART_MR) Optical Link Modulation Clock Duty Cycle Position */
#define UART_MR_OPT_DUTY_Msk                  (_UINT32_(0x7) << UART_MR_OPT_DUTY_Pos)              /* (UART_MR) Optical Link Modulation Clock Duty Cycle Mask */
#define UART_MR_OPT_DUTY(value)               (UART_MR_OPT_DUTY_Msk & (_UINT32_(value) << UART_MR_OPT_DUTY_Pos)) /* Assigment of value for OPT_DUTY in the UART_MR register */
#define   UART_MR_OPT_DUTY_DUTY_50_Val        _UINT32_(0x0)                                        /* (UART_MR) Modulation clock duty cycle Is 50%.  */
#define   UART_MR_OPT_DUTY_DUTY_43P75_Val     _UINT32_(0x1)                                        /* (UART_MR) Modulation clock duty cycle Is 43.75%.  */
#define   UART_MR_OPT_DUTY_DUTY_37P5_Val      _UINT32_(0x2)                                        /* (UART_MR) Modulation clock duty cycle Is 37.5%.  */
#define   UART_MR_OPT_DUTY_DUTY_31P25_Val     _UINT32_(0x3)                                        /* (UART_MR) Modulation clock duty cycle Is 31.75%.  */
#define   UART_MR_OPT_DUTY_DUTY_25_Val        _UINT32_(0x4)                                        /* (UART_MR) Modulation clock duty cycle Is 25%.  */
#define   UART_MR_OPT_DUTY_DUTY_18P75_Val     _UINT32_(0x5)                                        /* (UART_MR) Modulation clock duty cycle Is 18.75%.  */
#define   UART_MR_OPT_DUTY_DUTY_12P5_Val      _UINT32_(0x6)                                        /* (UART_MR) Modulation clock duty cycle Is 12.5%.  */
#define   UART_MR_OPT_DUTY_DUTY_6P25_Val      _UINT32_(0x7)                                        /* (UART_MR) Modulation clock duty cycle Is 6.25%.  */
#define UART_MR_OPT_DUTY_DUTY_50              (UART_MR_OPT_DUTY_DUTY_50_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 50%. Position  */
#define UART_MR_OPT_DUTY_DUTY_43P75           (UART_MR_OPT_DUTY_DUTY_43P75_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 43.75%. Position  */
#define UART_MR_OPT_DUTY_DUTY_37P5            (UART_MR_OPT_DUTY_DUTY_37P5_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 37.5%. Position  */
#define UART_MR_OPT_DUTY_DUTY_31P25           (UART_MR_OPT_DUTY_DUTY_31P25_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 31.75%. Position  */
#define UART_MR_OPT_DUTY_DUTY_25              (UART_MR_OPT_DUTY_DUTY_25_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 25%. Position  */
#define UART_MR_OPT_DUTY_DUTY_18P75           (UART_MR_OPT_DUTY_DUTY_18P75_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 18.75%. Position  */
#define UART_MR_OPT_DUTY_DUTY_12P5            (UART_MR_OPT_DUTY_DUTY_12P5_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 12.5%. Position  */
#define UART_MR_OPT_DUTY_DUTY_6P25            (UART_MR_OPT_DUTY_DUTY_6P25_Val << UART_MR_OPT_DUTY_Pos) /* (UART_MR) Modulation clock duty cycle Is 6.25%. Position  */
#define UART_MR_OPT_CMPTH_Pos                 _UINT32_(28)                                         /* (UART_MR) Receive Path Comparator Threshold Position */
#define UART_MR_OPT_CMPTH_Msk                 (_UINT32_(0x7) << UART_MR_OPT_CMPTH_Pos)             /* (UART_MR) Receive Path Comparator Threshold Mask */
#define UART_MR_OPT_CMPTH(value)              (UART_MR_OPT_CMPTH_Msk & (_UINT32_(value) << UART_MR_OPT_CMPTH_Pos)) /* Assigment of value for OPT_CMPTH in the UART_MR register */
#define   UART_MR_OPT_CMPTH_VDD3V3_DIV2_Val   _UINT32_(0x0)                                        /* (UART_MR) Comparator threshold is VDD3V3/2 volts.  */
#define   UART_MR_OPT_CMPTH_VDD3V3_DIV2P5_Val _UINT32_(0x1)                                        /* (UART_MR) Comparator threshold is VDD3V3/2.5 volts.  */
#define   UART_MR_OPT_CMPTH_VDD3V3_DIV3P3_Val _UINT32_(0x2)                                        /* (UART_MR) Comparator threshold is VDD3V3/3.3 volts.  */
#define   UART_MR_OPT_CMPTH_VDD3V3_DIV5_Val   _UINT32_(0x3)                                        /* (UART_MR) Comparator threshold is VDD3V3/5 volts.  */
#define   UART_MR_OPT_CMPTH_VDD3V3_DIV10_Val  _UINT32_(0x4)                                        /* (UART_MR) Comparator threshold is VDD3V3/10 volts.  */
#define UART_MR_OPT_CMPTH_VDD3V3_DIV2         (UART_MR_OPT_CMPTH_VDD3V3_DIV2_Val << UART_MR_OPT_CMPTH_Pos) /* (UART_MR) Comparator threshold is VDD3V3/2 volts. Position  */
#define UART_MR_OPT_CMPTH_VDD3V3_DIV2P5       (UART_MR_OPT_CMPTH_VDD3V3_DIV2P5_Val << UART_MR_OPT_CMPTH_Pos) /* (UART_MR) Comparator threshold is VDD3V3/2.5 volts. Position  */
#define UART_MR_OPT_CMPTH_VDD3V3_DIV3P3       (UART_MR_OPT_CMPTH_VDD3V3_DIV3P3_Val << UART_MR_OPT_CMPTH_Pos) /* (UART_MR) Comparator threshold is VDD3V3/3.3 volts. Position  */
#define UART_MR_OPT_CMPTH_VDD3V3_DIV5         (UART_MR_OPT_CMPTH_VDD3V3_DIV5_Val << UART_MR_OPT_CMPTH_Pos) /* (UART_MR) Comparator threshold is VDD3V3/5 volts. Position  */
#define UART_MR_OPT_CMPTH_VDD3V3_DIV10        (UART_MR_OPT_CMPTH_VDD3V3_DIV10_Val << UART_MR_OPT_CMPTH_Pos) /* (UART_MR) Comparator threshold is VDD3V3/10 volts. Position  */
#define UART_MR_Msk                           _UINT32_(0x771FDFFF)                                 /* (UART_MR) Register Mask  */


