Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/uart.h
/* -------- UART_SR : (UART Offset: 0x14) ( R/ 32) Interrupt Status Register -------- */
#define UART_SR_RXRDY_Pos                     _UINT32_(0)                                          /* (UART_SR) Receiver Ready (Cleared by reading the UART_RHR) Position */
#define UART_SR_RXRDY_Msk                     (_UINT32_(0x1) << UART_SR_RXRDY_Pos)                 /* (UART_SR) Receiver Ready (Cleared by reading the UART_RHR) Mask */
#define UART_SR_RXRDY(value)                  (UART_SR_RXRDY_Msk & (_UINT32_(value) << UART_SR_RXRDY_Pos)) /* Assigment of value for RXRDY in the UART_SR register */
#define UART_SR_TXRDY_Pos                     _UINT32_(1)                                          /* (UART_SR) Transmitter Ready (Cleared by writing the UART_THR) Position */
#define UART_SR_TXRDY_Msk                     (_UINT32_(0x1) << UART_SR_TXRDY_Pos)                 /* (UART_SR) Transmitter Ready (Cleared by writing the UART_THR) Mask */
#define UART_SR_TXRDY(value)                  (UART_SR_TXRDY_Msk & (_UINT32_(value) << UART_SR_TXRDY_Pos)) /* Assigment of value for TXRDY in the UART_SR register */
#define UART_SR_ENDRX_Pos                     _UINT32_(3)                                          /* (UART_SR) End of Receiver Transfer Position */
#define UART_SR_ENDRX_Msk                     (_UINT32_(0x1) << UART_SR_ENDRX_Pos)                 /* (UART_SR) End of Receiver Transfer Mask */
#define UART_SR_ENDRX(value)                  (UART_SR_ENDRX_Msk & (_UINT32_(value) << UART_SR_ENDRX_Pos)) /* Assigment of value for ENDRX in the UART_SR register */
#define UART_SR_ENDTX_Pos                     _UINT32_(4)                                          /* (UART_SR) End of Transmitter Transfer Position */
#define UART_SR_ENDTX_Msk                     (_UINT32_(0x1) << UART_SR_ENDTX_Pos)                 /* (UART_SR) End of Transmitter Transfer Mask */
#define UART_SR_ENDTX(value)                  (UART_SR_ENDTX_Msk & (_UINT32_(value) << UART_SR_ENDTX_Pos)) /* Assigment of value for ENDTX in the UART_SR register */
#define UART_SR_OVRE_Pos                      _UINT32_(5)                                          /* (UART_SR) Overrun Error (Cleared by writing UART_CR.RSTSTA) Position */
#define UART_SR_OVRE_Msk                      (_UINT32_(0x1) << UART_SR_OVRE_Pos)                  /* (UART_SR) Overrun Error (Cleared by writing UART_CR.RSTSTA) Mask */
#define UART_SR_OVRE(value)                   (UART_SR_OVRE_Msk & (_UINT32_(value) << UART_SR_OVRE_Pos)) /* Assigment of value for OVRE in the UART_SR register */
#define UART_SR_FRAME_Pos                     _UINT32_(6)                                          /* (UART_SR) Framing Error (Cleared by writing UART_CR.RSTSTA) Position */
#define UART_SR_FRAME_Msk                     (_UINT32_(0x1) << UART_SR_FRAME_Pos)                 /* (UART_SR) Framing Error (Cleared by writing UART_CR.RSTSTA) Mask */
#define UART_SR_FRAME(value)                  (UART_SR_FRAME_Msk & (_UINT32_(value) << UART_SR_FRAME_Pos)) /* Assigment of value for FRAME in the UART_SR register */
#define UART_SR_PARE_Pos                      _UINT32_(7)                                          /* (UART_SR) Parity Error (Cleared by writing UART_CR.RSTSTA) Position */
#define UART_SR_PARE_Msk                      (_UINT32_(0x1) << UART_SR_PARE_Pos)                  /* (UART_SR) Parity Error (Cleared by writing UART_CR.RSTSTA) Mask */
#define UART_SR_PARE(value)                   (UART_SR_PARE_Msk & (_UINT32_(value) << UART_SR_PARE_Pos)) /* Assigment of value for PARE in the UART_SR register */
#define UART_SR_TIMEOUT_Pos                   _UINT32_(8)                                          /* (UART_SR) Receiver Time-out (Cleared by writing the UART_CR.STTTO) Position */
#define UART_SR_TIMEOUT_Msk                   (_UINT32_(0x1) << UART_SR_TIMEOUT_Pos)               /* (UART_SR) Receiver Time-out (Cleared by writing the UART_CR.STTTO) Mask */
#define UART_SR_TIMEOUT(value)                (UART_SR_TIMEOUT_Msk & (_UINT32_(value) << UART_SR_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the UART_SR register */
#define UART_SR_TXEMPTY_Pos                   _UINT32_(9)                                          /* (UART_SR) Transmitter Empty (Cleared by writing the UART_THR) Position */
#define UART_SR_TXEMPTY_Msk                   (_UINT32_(0x1) << UART_SR_TXEMPTY_Pos)               /* (UART_SR) Transmitter Empty (Cleared by writing the UART_THR) Mask */
#define UART_SR_TXEMPTY(value)                (UART_SR_TXEMPTY_Msk & (_UINT32_(value) << UART_SR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the UART_SR register */
#define UART_SR_TXBUFE_Pos                    _UINT32_(11)                                         /* (UART_SR) Transmission Buffer Empty Position */
#define UART_SR_TXBUFE_Msk                    (_UINT32_(0x1) << UART_SR_TXBUFE_Pos)                /* (UART_SR) Transmission Buffer Empty Mask */
#define UART_SR_TXBUFE(value)                 (UART_SR_TXBUFE_Msk & (_UINT32_(value) << UART_SR_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the UART_SR register */
#define UART_SR_RXBUFF_Pos                    _UINT32_(12)                                         /* (UART_SR) Receive Buffer Full Position */
#define UART_SR_RXBUFF_Msk                    (_UINT32_(0x1) << UART_SR_RXBUFF_Pos)                /* (UART_SR) Receive Buffer Full Mask */
#define UART_SR_RXBUFF(value)                 (UART_SR_RXBUFF_Msk & (_UINT32_(value) << UART_SR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the UART_SR register */
#define UART_SR_CMP_Pos                       _UINT32_(15)                                         /* (UART_SR) Comparison Match (Cleared by writing the UART_CR.RSTSTA) Position */
#define UART_SR_CMP_Msk                       (_UINT32_(0x1) << UART_SR_CMP_Pos)                   /* (UART_SR) Comparison Match (Cleared by writing the UART_CR.RSTSTA) Mask */
#define UART_SR_CMP(value)                    (UART_SR_CMP_Msk & (_UINT32_(value) << UART_SR_CMP_Pos)) /* Assigment of value for CMP in the UART_SR register */
#define UART_SR_ACE_Pos                       _UINT32_(16)                                         /* (UART_SR) Analog Comparator Event Interrupt (Cleared by writing UART_CR.RSTSTA) Position */
#define UART_SR_ACE_Msk                       (_UINT32_(0x1) << UART_SR_ACE_Pos)                   /* (UART_SR) Analog Comparator Event Interrupt (Cleared by writing UART_CR.RSTSTA) Mask */
#define UART_SR_ACE(value)                    (UART_SR_ACE_Msk & (_UINT32_(value) << UART_SR_ACE_Pos)) /* Assigment of value for ACE in the UART_SR register */
#define UART_SR_Msk                           _UINT32_(0x00019BFB)                                 /* (UART_SR) Register Mask  */


